# secify where to install applications
cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Desktop applications
cask "adobe-acrobat-reader"
cask "appcleaner"
cask "bitwarden"
cask "deepl"
cask "discord"
cask "docker"
cask "firefox"
cask "flux"
cask "gitify"
cask "google-chrome"
cask "grammarly"
cask "iterm2"
cask "ngrok"
cask "notion"
cask "microsoft-edge"
cask "skitch"
cask "slack"
cask "sourcetree"
cask "tableplus"
cask "visual-studio-code"
cask "zoom"

# CLI applications
brew "asdf"
brew "awscli"
brew "commitizen"
brew "exa"
brew "git"
brew "gpg"
brew "jq"
brew "mas"
brew "lazygit"
brew "peco"
brew "pinentry-mac"
brew "starship"
brew "tmux"
brew "tree"
brew "wget"
