# secify where to install applications
cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "mongodb/brew"

# Desktop applications
cask "adobe-acrobat-reader"
cask "amazon-q"
cask "android-studio"
cask "anki"
cask "appcleaner"
cask "arc"
cask "bitwarden"
cask "chatgpt"
cask "cursor"
cask "deepl"
cask "discord"
cask "docker"
cask "figma"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "grammarly"
cask "iterm2"
cask "ngrok"
cask "nordvpn"
cask "notion"
cask "microsoft-edge"
cask "ollama"
cask "orbstack"
cask "postman"
cask "pushplaylabs-sidekick"
cask "rectangle"
cask "redis-insight"
cask "sequel-ace"
cask "skitch"
cask "slack"
cask "sourcetree"
cask "tableplus"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"

# CLI applications
brew "act"
brew "asdf"
brew "awscli"
brew "bash"
brew "commitizen"
brew "exa"
brew "git"
brew "gpg"
brew "jq"
brew "mas"
brew "lazygit"
brew "libvterm"
brew "peco"
brew "pinentry-mac"
brew "pkg-config"
brew "starship"
brew "tmux"
brew "tree"
